# DefaultConstructionMassSlab Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DefaultConstructionMassSlab Property
ParameterTypeId Class See Also
---
"Mass Slab"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DefaultConstructionMassSlab { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DefaultConstructionMassSlab As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DefaultConstructionMassSlab {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace